app/Http/Controllers/AdminUserDoController.php

    public function save(AdminUserRequest $request, AdminUser $adminuser)
    {
        $this->authorizeForUser(Auth::guard('admin')->user(),'modify', $adminuser);

        $data=$request->validated();

        if ($adminuser->id){
            if ($data['password']){
                $data['password'] = Hash::make($data['password']);
            }else{
                unset($data['password']);
            }
            $adminuser->update($data);
---
update `admin_users` set `username` = 'superadmin', `admin_users`.`updated_at` = '2020-01-17 11:12:48' where `id` = 1

    public function remove(AdminUser $adminuser)
    {

//        dd($adminuser); exit;
        $adminuser->delete();
---
update `admin_users` set `deleted_at` = '2020-01-17 02:34:34', `admin_users`.`updated_at` = '2020-01-17 02:34:34' where `id` = 3

    public function state(AdminUser $adminuser)
    {
//        dd($adminuser); exit;

        $this->authorizeForUser(Auth::guard('admin')->user(),'remove', $adminuser);

        $adminuser->state = ($adminuser->state == (int)true)? $adminuser->state=(int)false : $adminuser->state=(int)true;
        $adminuser->save();
---
update `admin_users` set `state` = 0, `admin_users`.`updated_at` = '2020-01-17 11:10:21' where `id` = 2